IDENTIFICATION DIVISION.
       PROGRAM-ID. DB-CONSULT.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LK-ID            PIC 9(05).
       01 LK-SALDO         PIC 9(10)V99.
       PROCEDURE DIVISION USING LK-ID LK-SALDO.
           EXEC SQL 
               SELECT SALDO INTO :LK-SALDO FROM CUENTAS WHERE ID = :LK-ID 
           END-EXEC.
           EXIT PROGRAM.
