IDENTIFICATION DIVISION.
       PROGRAM-ID. DB-UPDATE.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LK-ID            PIC 9(05).
       01 LK-NUEVO-SALDO   PIC 9(10)V99.
       PROCEDURE DIVISION USING LK-ID LK-NUEVO-SALDO.
           EXEC SQL 
               UPDATE CUENTAS SET SALDO = :LK-NUEVO-SALDO WHERE ID = :LK-ID 
           END-EXEC.
           EXEC SQL COMMIT END-EXEC.
           EXIT PROGRAM.
