IDENTIFICATION DIVISION.
PROGRAM-ID. PROCESO-BANCO.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
       SELECT TRANS-FILE ASSIGN TO "transacciones.txt"
       ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD  TRANS-FILE.
01  TRANS-REG.
       05 TR-ID      PIC 9(5).
       05 TR-MONTO   PIC 9(8)V99.

WORKING-STORAGE SECTION.
EXEC SQL BEGIN DECLARE SECTION END-EXEC.
01 DB-SALDO       PIC 9(10)V99.
01 ID-BUSCAR      PIC 9(5).
EXEC SQL END DECLARE SECTION END-EXEC.

PROCEDURE DIVISION.
MAIN-PROCEDURE.
       OPEN INPUT TRANS-FILE.
       PERFORM UNTIL EXIT
              READ TRANS-FILE AT END EXIT PERFORM END-READ
              MOVE TR-ID TO ID-BUSCAR
               
               * Consulta saldo actual
               EXEC SQL SELECT SALDO INTO :DB-SALDO 
                        FROM CUENTAS WHERE ID = :ID-BUSCAR END-EXEC
               
               * Sumar monto
               COMPUTE DB-SALDO = DB-SALDO + TR-MONTO
               
               * Actualizar BD
               EXEC SQL UPDATE CUENTAS SET SALDO = :DB-SALDO 
                        WHERE ID = :ID-BUSCAR END-EXEC
       END-PERFORM.
       CLOSE TRANS-FILE.
       STOP RUN.
