IDENTIFICATION DIVISION.
       PROGRAM-ID. LOG-ERROR.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LK-ID            PIC 9(05).
       01 LK-ERROR-CODE    PIC X(02).
       PROCEDURE DIVISION USING LK-ID LK-ERROR-CODE.
           DISPLAY "AUDITORIA: TRANSACCION RECHAZADA - ID: " LK-ID.
           DISPLAY "MOTIVO: " LK-ERROR-CODE.
           EXIT PROGRAM.
