IDENTIFICATION DIVISION.
       PROGRAM-ID. VAL-MOTOR.
       
       DATA DIVISION.
       LINKAGE SECTION.
       01 LS-AREA-INTERCAMBIO.
          05 LS-SALDO-ACTUAL PIC 9(10)V99.
          05 LS-MONTO-TRANS  PIC 9(08)V99.
          05 LS-NUEVO-SALDO  PIC 9(10)V99.
          05 LS-RESULT-CODE  PIC X(02).

       PROCEDURE DIVISION USING LS-AREA-INTERCAMBIO.
       
       100-VALIDAR-Y-CALCULAR.
           MOVE 'ER' TO LS-RESULT-CODE
           
      * REGLA 1: EL MONTO DEBE SER POSITIVO
           IF LS-MONTO-TRANS > 0
      * REGLA 2: NO SE PERMITE SOBREGIRO (EJEMPLO)
               IF LS-SALDO-ACTUAL + LS-MONTO-TRANS >= 0
                   COMPUTE LS-NUEVO-SALDO = 
                           LS-SALDO-ACTUAL + LS-MONTO-TRANS
                   MOVE 'OK' TO LS-RESULT-CODE
               END-IF
           END-IF.
           
           EXIT PROGRAM.
