       01  PAYMENT-RECORD.
           05 PAY-ID              PIC X(12).
           05 PAY-CUSTOMER-ID     PIC X(10).
           05 PAY-ACCOUNT-ID      PIC X(12).
           05 PAY-AMOUNT          PIC 9(9)V99.
           05 PAY-CURRENCY        PIC X(3).
           05 PAY-CHANNEL         PIC X(10).
           05 PAY-DESTINATION     PIC X(12).
           05 PAY-REQUEST-DATE    PIC 9(8).
